csh
source /home/install/cshrc
genus

set_db / .init_lib_search_path {/home/install/FOUNDRY/digital/45nm/dig/lib}
set_db / .init_hdl_search_path {rtl}
set_db / .library "typical.lib"
set_db lp_insert_clock_gating true

read_hdl design.v
elaborate division2

read_sdc constraints.sdc

set_db syn_generic_effort high
set_db syn_generic_effort high
set_db syn_opt_effort high
syn_generic
syn_map
syn_opt

check_timing 
check_design -all

report timing > design_timing.rpt
report area > design_area.rpt
report power > design_power.rpt

write_hdl > design_netlist.v

gui_show
